In [1]:
import pandas as pd
import numpy as np
from sklearn import linear_model
import matplotlib.pyplot as plt

In [3]:
df = pd.read_csv('homeprices.csv')
df

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       NaN   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000
5  4100       6.0    8  810000

In [4]:
df.bedrooms.fillna(df.bedrooms.median(),inplace=True)
df

   area  bedrooms  age   price
0  2600       3.0   20  550000
1  3000       4.0   15  565000
2  3200       4.0   18  610000
3  3600       3.0   30  595000
4  4000       5.0    8  760000
5  4100       6.0    8  810000

In [5]:
x=df.drop('price',axis='columns')
x

   area  bedrooms  age
0  2600       3.0   20
1  3000       4.0   15
2  3200       4.0   18
3  3600       3.0   30
4  4000       5.0    8
5  4100       6.0    8

In [6]:
y=df.price
y

0    550000
1    565000
2    610000
3    595000
4    760000
5    810000
Name: price, dtype: int64

In [7]:
reg = linear_model.LinearRegression()

In [8]:
reg.fit(x,y)

LinearRegression()

In [9]:
reg.predict([[2500,4.0,6]])

array([575644.3195807])

# Excersice 2

In [2]:
hire = pd.read_csv('hiring.csv')
hire

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    NaN                           7      72000
7     eleven                    7.0                           8      80000

In [3]:
hire['test_score(out of 10)'].fillna(hire['test_score(out of 10)'].median(),inplace=True)
hire

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    8.0                           7      72000
7     eleven                    7.0                           8      80000

In [4]:
hire.loc[0,'experience']='nine'
hire.loc[1,'experience']='sex'
hire

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       nine                    8.0                           9      50000
1        sex                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000
5      three                    7.0                          10      62000
6        ten                    8.0                           7      72000
7     eleven                    7.0                           8      80000

In [5]:
hire.replace(to_replace=['two','three','five','sex','seven','nine','ten','eleven'],value=[2,3,5,6,7,9,10,11],inplace=True)

In [6]:
hire

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           9                    8.0                           9      50000
1           6                    8.0                           6      45000
2           5                    6.0                           7      60000
3           2                   10.0                          10      65000
4           7                    9.0                           6      70000
5           3                    7.0                          10      62000
6          10                    8.0                           7      72000
7          11                    7.0                           8      80000

In [7]:
x=hire.drop('salary($)',axis='columns')
y=hire['salary($)']

In [8]:
reg2=linear_model.LinearRegression()

In [9]:
reg2.fit(x,y)

LinearRegression()

In [11]:
reg2.score(x,y)

0.15363983550999205